       IDENTIFICATION DIVISION.
       PROGRAM-ID. AddNumbers.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(2) VALUE 10.
       01 NUM2 PIC 9(2) VALUE 20.
       01 SUMV PIC 9(2).
       PROCEDURE DIVISION.
       ADD NUM1 TO NUM2 GIVING SUMV.
       DISPLAY 'Sum: ' SUMV.
       STOP RUN.
