       IDENTIFICATION DIVISION.
       PROGRAM-ID. SimpleInterest.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PRINCIPAL   PIC 9(5)V99 VALUE 1000.00.
       01 RATE        PIC 9V99 VALUE 5.0.
       01 TIMEV       PIC 9(2) VALUE 2.
       01 INTEREST    PIC 9(5)V99.
       PROCEDURE DIVISION.
       COMPUTE INTEREST = (PRINCIPAL * RATE * TIMEV) / 100.
       DISPLAY 'Simple Interest: ' INTEREST.
       STOP RUN.
